### Q: What day in the week of May 20, 2017 has the most traffic?

In [2]:
import pandas as pd

In [3]:
url="http://web.mta.info/developers/data/nyct/turnstile/turnstile_170527.txt"
df = pd.read_csv(url)

In [4]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/20/2017,00:00:00,REGULAR,6184841,2095161
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/20/2017,04:00:00,REGULAR,6184865,2095167
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/20/2017,08:00:00,REGULAR,6184891,2095192
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/20/2017,12:00:00,REGULAR,6184973,2095275
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/20/2017,16:00:00,REGULAR,6185217,2095326

In [5]:
df.shape

(195463, 11)

In [6]:
df2 = df.drop(['C/A','UNIT','SCP','DIVISION','DESC'],axis=1)
df2.head()

,STATION,LINENAME,DATE,TIME,ENTRIES,EXITS
0,59 ST,NQR456W,05/20/2017,00:00:00,6184841,2095161
1,59 ST,NQR456W,05/20/2017,04:00:00,6184865,2095167
2,59 ST,NQR456W,05/20/2017,08:00:00,6184891,2095192
3,59 ST,NQR456W,05/20/2017,12:00:00,6184973,2095275
4,59 ST,NQR456W,05/20/2017,16:00:00,6185217,2095326

In [7]:
df2.shape

(195463, 6)

In [8]:
may_20 = df2.loc[df['DATE'] == '05/20/2017']
may_21 = df2.loc[df['DATE'] == '05/21/2017']
may_22 = df2.loc[df['DATE'] == '05/22/2017']
may_23 = df2.loc[df['DATE'] == '05/23/2017']
may_24 = df2.loc[df['DATE'] == '05/24/2017']
may_25 = df2.loc[df['DATE'] == '05/25/2017']
may_26 = df2.loc[df['DATE'] == '05/26/2017']

In [9]:
may_20.shape

(27908, 6)

In [10]:
may_21.shape

(27877, 6)

In [11]:
may_26.shape

(27766, 6)

In [12]:
may_26.head()

,STATION,LINENAME,DATE,TIME,ENTRIES,EXITS
35,59 ST,NQR456W,05/26/2017,00:00:00,6193582,2097840
36,59 ST,NQR456W,05/26/2017,04:00:00,6193605,2097841
37,59 ST,NQR456W,05/26/2017,08:00:00,6193662,2097925
38,59 ST,NQR456W,05/26/2017,12:00:00,6193864,2098174
39,59 ST,NQR456W,05/26/2017,16:00:00,6194321,2098233

In [31]:
days = [may_20,may_21,may_22,may_23,may_24,may_25,may_26]
day_traffic = []
for day in days:
    day_traffic.append(day['ENTRIES'].sum())
    
day_traffic

[1069701507644,
 1069538545322,
 1068580106303,
 1064923953117,
 1096762144800,
 1063316626130,
 1057459960083]

In [57]:
headers = df2.dtypes.index
for header in df2.dtypes.index:
    header.strip()
df2.dtypes.index

Index(['STATION', 'LINENAME', 'DATE', 'TIME', 'ENTRIES',
       'EXITS                                                               ',
       'traffic'],
      dtype='object')

In [55]:
headers[5].strip()

'EXITS'

In [58]:
days = [may_20,may_21,may_22,may_23,may_24,may_25,may_26]
day_traffic_e = []
for day in days:
    day_traffic_e.append(day[headers[5]].sum())
    
day_traffic_e

[859903905146,
 860290931424,
 859842535859,
 858734892493,
 885631702176,
 857834098398,
 849183539466]

In [60]:
day_traffic_e.index(max(day_traffic_e))

4

In [61]:
max(day_traffic_e)

885631702176